Revit 2026 API

# InitialFluxIntensity Class

---

This class encapsulates initial flux intensity calculation.

SystemObject Autodesk.Revit.DB.LightingInitialIntensity Autodesk.Revit.DB.LightingInitialFluxIntensity

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InitialFluxIntensity : InitialIntensity
```
```vb
Public Class InitialFluxIntensity
	Inherits InitialIntensity
```
```cpp
public ref class InitialFluxIntensity : public InitialIntensity
```
```fsharp
type InitialFluxIntensity =
    class
        inherit InitialIntensity
    end
```

The InitialFluxIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InitialFluxIntensity(Double) | Creates an initial flux intensity object with the given document and flux values. |
|  | InitialFluxIntensity(InitialFluxIntensity) | Creates a copy of the given initial flux intensity object |

|  | Name | Description |
| --- | --- | --- |
|  | Flux | The flux intensity value. |
|  | InitialIntensityValue | The calculated initial intensity value. (Inherited from InitialIntensity) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity) |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialIntensity derived object. (Inherited from InitialIntensity) |
|  | Dispose | (Inherited from InitialIntensity) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace